In [2]:
%%sql
SHOW Databases

+------------+
|  namespace |
+------------+
| coffeeshop |
|    default |
|     sample |
+------------+

In [3]:
%%sql
use coffeeshop

++
||
++
++

## Cek Semua Database

In [4]:
%%sql
Show tables

+------------+--------------+-------------+
|  namespace |    tableName | isTemporary |
+------------+--------------+-------------+
| coffeeshop |   categories |       False |
| coffeeshop |     products |       False |
| coffeeshop |       stores |       False |
| coffeeshop | transactions |       False |
+------------+--------------+-------------+

In [39]:
%%sql

select * from categories

+-------------+---------------+
| category_id | category_name |
+-------------+---------------+
|           1 |        Coffee |
|           2 |    Non-Coffee |
|           3 |        Snacks |
+-------------+---------------+

In [43]:
%%sql

select * from products

+------------+--------------------------+-------------+------------+
| product_id |             product_name | category_id | unit_price |
+------------+--------------------------+-------------+------------+
|        101 |               Kopi Telur |           1 |      15000 |
|        102 | Kopi Kelaga Khas Vietnam |           1 |      17000 |
|        103 |        Kopi Vietnam Drip |           1 |      15000 |
|        104 |              Kopi Butter |           1 |      15000 |
|        105 |        Kopi Susu Kampung |           1 |      10000 |
|        106 |              Kopi Coklat |           1 |      17000 |
|        107 |             Es Kopi Susu |           1 |      13000 |
|        108 |            Es Kopi Hitam |           1 |       9000 |
|        109 | Es Kopi Hitam Pake Lemon |           1 |      12000 |
|        110 |          Drip Bag Coffee |           1 |      19000 |
|        201 |             Matcha Latte |           2 |      35000 |
|        202 |                Chocolate |           2 |      38000 |
|        203 |                Lemon Tea |           2 |      28000 |
|        204 |         Red Velvet Latte |           2 |      37000 |
|        301 |                Croissant |           3 |      20000 |
|        302 |                 Brownies |           3 |      25000 |
|        303 |                 Sandwich |           3 |      30000 |
|        304 |              Cheese Cake |           3 |      35000 |
+------------+--------------------------+-------------+------------+

In [48]:
%%sql

select * from stores limit 10;

+----------+------------------------+-----------+
| store_id |             store_name | city_name |
+----------+------------------------+-----------+
|        1 | Jue Coffee Bojongsoang |   Bandung |
|        2 |     Jue Coffee Cijerah |   Bandung |
|        3 |    Jue Coffee Kuningan |   Jakarta |
|        4 |       Jue Coffee Tebet |   Jakarta |
|        5 |        Jue Coffee Dago |   Bandung |
|        6 | Jue Coffee Asia Afrika |   Bandung |
|        7 |   Jue Coffee Buah Batu |   Bandung |
|        8 |    Jue Coffee Antapani |   Bandung |
|        9 |   Jue Coffee Setiabudi |   Bandung |
|       10 |   Jue Coffee Arcamanik |   Bandung |
+----------+------------------------+-----------+

In [38]:
%%sql

Select * from transactions limit 10

+--------------------------------------+---------------------+----------+-------------+------------+----------+----------------+-------+
|                       transaction_id |            datetime | store_id | customer_id | product_id | quantity | payment_method | price |
+--------------------------------------+---------------------+----------+-------------+------------+----------+----------------+-------+
| bdd640fb-0667-4ad1-9c80-317fa3b1799d | 2023-07-09 17:14:08 |       48 |        None |        104 |        4 |           QRIS | 60000 |
| 07a0ca6e-0822-48f3-ac03-1199972a8469 | 2023-07-03 17:14:32 |       39 |        None |        101 |        4 |          Gopay | 60000 |
| 8b8148f6-b38a-488c-a65e-d389b74d0fb1 | 2023-07-14 12:28:37 |       18 |        None |        101 |        1 |     Debit card | 15000 |
| 371ecd7b-27cd-4130-8722-9389571aa876 | 2023-07-25 13:06:05 |       25 |        None |        104 |        2 |           DANA | 30000 |
| 0b1f9163-ce9f-457f-83b7-a3a69a8dca03 | 2023-07-24 09:34:07 |       25 |        None |        103 |        4 |      ShopeePay | 60000 |
| e2acf72f-9e57-4f7a-a0ee-89aed453dd32 | 2023-07-28 20:36:12 |       46 |        None |        103 |        1 |          Gopay | 15000 |
| 146d3f31-fc37-4a4c-8a15-544dc5e7ce8a | 2023-07-28 17:55:06 |       25 |        None |        109 |        2 |           DANA | 24000 |
| 35a240ae-5af3-4553-9ec4-2e0829a3b2e9 | 2023-07-22 13:44:59 |       44 |        None |        103 |        1 |          Gopay | 15000 |
| 451b4cf3-6123-4df7-b656-af7229d4beef | 2023-07-30 10:43:20 |       54 |        None |        102 |        1 |           Cash | 17000 |
| 448aaa9e-66b2-4c5b-90c1-87fcce177b4e | 2023-07-03 17:58:36 |       46 |        None |        201 |        1 |    Credit card | 35000 |
+--------------------------------------+---------------------+----------+-------------+------------+----------+----------------+-------+

## 1. Jumlah Dataset

In [71]:
%%sql
Select Count(*) as Total_Transaksi from transactions

+-----------------+
| Total_Transaksi |
+-----------------+
|         1000000 |
+-----------------+

In [72]:
%%sql
Select Count(*) as Total_Toko from stores

+------------+
| Total_Toko |
+------------+
|         54 |
+------------+

In [73]:
%%sql
Select Count(*) as Total_Produk from products

+--------------+
| Total_Produk |
+--------------+
|           18 |
+--------------+

In [74]:
%%sql
Select Count(*) as Total_Kategori from categories

+----------------+
| Total_Kategori |
+----------------+
|              3 |
+----------------+

Maka Total Dataset 1000075

## 2. Jumlah Hari

In [15]:
%%sql

select count(distinct date(datetime)) as Jumlah_Hari from transactions

+-------------+
| Jumlah_Hari |
+-------------+
|          30 |
+-------------+

Terdapat 30 Hari Dalam Database Transaksi

## 3. Maximum dan Mininum sebuah pembelian

In [18]:
%%sql

select MAX(quantity) as Max_Pembelian, Min(quantity) as Min_Pembelian from transactions

+---------------+---------------+
| Max_Pembelian | Min_Pembelian |
+---------------+---------------+
|             4 |             1 |
+---------------+---------------+

Maximum sebuah pembelian adalah 4 buah dan minimum sebuah pembelian adalah 1 buah

## 4. Total Jenis Pemabayaran

In [19]:
%%sql

select count(distinct payment_method) as Jenis_Pembayaran from transactions

+------------------+
| Jenis_Pembayaran |
+------------------+
|                8 |
+------------------+

Terdapat 8 Jenis Pembayaran

## 5. Menghitung Berapa Customer Yang NULL

In [37]:
%%sql
select count(*) as Customer_Null from transactions where customer_id is null;

+---------------+
| Customer_Null |
+---------------+
|       1000000 |
+---------------+

Terdapat 1000000 Customer_id yang NULL

## 6. Jumlah Transaksi Penjualan

In [70]:
%%sql

Select
    date(datetime) as Hari,
    count(*) as Transaksi,
    sum(price) as Total_Revenue
from transactions
group by date(datetime)
order by Hari

+------------+-----------+---------------+
|       Hari | Transaksi | Total_Revenue |
+------------+-----------+---------------+
| 2023-07-01 |     33403 |    1204709000 |
| 2023-07-02 |     33435 |    1207624000 |
| 2023-07-03 |     33364 |    1203941000 |
| 2023-07-04 |     33302 |    1204213000 |
| 2023-07-05 |     33324 |    1209537000 |
| 2023-07-06 |     33467 |    1209819000 |
| 2023-07-07 |     33400 |    1199825000 |
| 2023-07-08 |     33446 |    1206245000 |
| 2023-07-09 |     33210 |    1201149000 |
| 2023-07-10 |     33632 |    1218836000 |
| 2023-07-11 |     33512 |    1206927000 |
| 2023-07-12 |     33244 |    1204468000 |
| 2023-07-13 |     33252 |    1205719000 |
| 2023-07-14 |     33230 |    1194160000 |
| 2023-07-15 |     33354 |    1202659000 |
| 2023-07-16 |     33373 |    1207032000 |
| 2023-07-17 |     33304 |    1209939000 |
| 2023-07-18 |     32974 |    1187088000 |
| 2023-07-19 |     33344 |    1201890000 |
| 2023-07-20 |     33500 |    1209653000 |
| 2023-07-21 |     32910 |    1184348000 |
| 2023-07-22 |     33302 |    1193814000 |
| 2023-07-23 |     33074 |    1192013000 |
| 2023-07-24 |     33634 |    1209558000 |
| 2023-07-25 |     33514 |    1204470000 |
| 2023-07-26 |     33076 |    1190571000 |
| 2023-07-27 |     33381 |    1199779000 |
| 2023-07-28 |     33260 |    1197197000 |
| 2023-07-29 |     33283 |    1209655000 |
| 2023-07-30 |     33496 |    1200399000 |
+------------+-----------+---------------+

## 7. Total Kategori Yang Terjual

In [68]:
%%sql
select
    c.category_name as Kategori,
    sum(t.quantity) as Quantity
from transactions t
join products p on p.product_id = t.product_id
join categories c on c.category_id = p.category_id
Group by Kategori

+------------+----------+
|   Kategori | Quantity |
+------------+----------+
|     Coffee |   925415 |
| Non-Coffee |   369924 |
|     Snacks |   369891 |
+------------+----------+

- Barang **Coffee** terjual dengan **925415** buah
- Barang **Non-Coffee**	terjual dengan **369924** buah
- Barang **Snacks** terjual dengan **369891** buah

## 8. Produk Top 5

In [84]:
%%sql

select
    p.product_name as Nama_Produk,
    sum(t.quantity) as Quantity,
    sum(t.price) as Total_Penjualan
from transactions t
join products p on t.product_id = p.product_id
group by Nama_Produk
order by Quantity DESC
limit 5;

+--------------------------+----------+-----------------+
|              Nama_Produk | Quantity | Total_Penjualan |
+--------------------------+----------+-----------------+
|              Cheese Cake |    93327 |      3266445000 |
|               Kopi Telur |    93222 |      1398330000 |
| Kopi Kelaga Khas Vietnam |    93053 |      1581901000 |
|        Kopi Susu Kampung |    92915 |       929150000 |
| Es Kopi Hitam Pake Lemon |    92839 |      1114068000 |
+--------------------------+----------+-----------------+

Top 5 Produk Adalah:
- **Cheese Cake** dengan **93327** Buah Terjual
- **Kopi Telur** dengan **93222** Buah Terjual
- **Kopi Kelaga Khas Vietnam** dengan **93053** Buah Terjual
- **Kopi Susu Kampung** dengan **92915** Buah Terjual
- **Es Kopi Hitam Pake Lemon** dengan **92839** Buah Terjual

## 9. Jumlah Transaksi Per Toko Per Hari

In [88]:
%%sql

select
    Date(t.datetime) as Hari,
    s.store_name as Toko,
    count(*) as Transaksi,
    sum(t.price) as Total_Penjualan
from transactions t
join stores s on t.store_id = s.store_id
group by Hari, Toko
order by Hari, Toko
limit 10

+------------+--------------------------+-----------+-----------------+
|       Hari |                     Toko | Transaksi | Total_Penjualan |
+------------+--------------------------+-----------+-----------------+
| 2023-07-01 |      Jue Coffee Antapani |       635 |        23826000 |
| 2023-07-01 |     Jue Coffee Arcamanik |       593 |        21702000 |
| 2023-07-01 |   Jue Coffee Asia Afrika |       644 |        23986000 |
| 2023-07-01 |        Jue Coffee Blok M |       610 |        22325000 |
| 2023-07-01 |   Jue Coffee Bojongsoang |       595 |        21420000 |
| 2023-07-01 |     Jue Coffee Buah Batu |       689 |        23976000 |
| 2023-07-01 | Jue Coffee Cempaka Putih |       612 |        22810000 |
| 2023-07-01 |    Jue Coffee Cihampelas |       616 |        20877000 |
| 2023-07-01 |       Jue Coffee Cihapit |       550 |        19051000 |
| 2023-07-01 |       Jue Coffee Cijerah |       626 |        23356000 |
+------------+--------------------------+-----------+-----------------+

## 10. Toko Paling Ramai

In [60]:
%%sql

select
    s.store_name as Toko,
    count(t.price) as Total_Transaksi
from stores s
join transactions t on s.store_id = t.store_id
Group by Toko
order by Total_Transaksi DESC
limit 1

+----------------------+-----------------+
|                 Toko | Total_Transaksi |
+----------------------+-----------------+
| Jue Coffee Tunjungan |           18792 |
+----------------------+-----------------+

Toko yang paling ramai adalah **Jue Coffeee Tunjungan** dengan Total Tranasaksi sebanyak **18792 buah**

## 11. Toko Paling Banyak Penjualan

In [65]:
%%sql

select 
    s.store_name as Toko,
    sum(t.price) as Total_Revenue
from transactions t
join stores s on s.store_id = t.store_id
where t.payment_method in ('QRIS', 'Ovo', 'Gopay', 'ShopeePay', 'DANA', 'Debit card', 'Credit card')
group by Toko
Order by Total_Revenue DESC
limit 1

+-------------------------+---------------+
|                    Toko | Total_Revenue |
+-------------------------+---------------+
| Jue Coffee Pakuwon Mall |     595432000 |
+-------------------------+---------------+

Toko yang paling banyak penjualan adalah **Jue Coffee Pakuwon Mall** dengan Total penjualan sebanyak **595.432.000 rb**